#+AUTHOR: emacsist
#+CREATOR: emacsist
#+DATE: <2017-03-02 Thu>
#+EMAIL: emacsist@qq.com
#+LANGUAGE: zh
#+TITLE: Org mode 手册学习笔记

*** 列组（Column groups）
    当导出表格时，默认情况下是没有垂直线的。
    你可以使用一个特别的行，这个行的第一个单元仅包含 */* 。该行的其他单元，包含 *<* 或者 *>* 或者 *<>* （该列自身为一组）。每一组是以 *<* 所在的列为开始， *>* 所在的列为结束。例如：

    | N | N^2 | N^3 | N^4 | ~sqrt(n)~ | ~sqrt[4](N)~ |
    |---+-----+-----+-----+-----------+--------------|
    | / |   < |     |   > |         < |            > |
    | 1 |   1 |   1 |   1 |         1 |            1 |
    | 2 |   4 |   8 |  16 | 1.4142136 |    1.1892071 |
    | 3 |   9 |  27 |  81 | 1.7320508 |    1.3160740 |
    #+TBLFM: $2=$1^2::$3=$1^3::$4=$1^4::$5=sqrt($1)::$6=sqrt(sqrt(($1)))


**** 持续时间和时间值
     如果想计算时间值，可以使用 *T* 标记。无论是在 calc 还是 elisp 公式中都可以。例如：
     |  Task 1 |   Task 2 |   Task 3 |
     |---------+----------+----------|
     |    2:12 |     1:47 | 03:59:00 |
     | 3:02:20 | -2:07:00 |     0.92 |
     #+TBLFM: @2$3=$1+$2;T::@3$3=$1+$2;t

     持续时间的值必须是形如： *HH:MM:[:SS]*，秒是可选的。当使用 
     *T* 标记时，持续时间将会显示为： *HH:MM:SS*（上面的第一个公式）
     *t* 标记时，这个值的显示，取决于 *org-table-duration-custom-format* 参数的值。默认情况下是 *'hours*，所以，将会显示的是多少小时。（上面的第二个公式）
     
     负数的持续时间也是可以计算的。一个普通的整型值，将被视作是秒数。


**** 高级功能
     要想开启高级功能，你需要保留表格的第一列作为特殊的标记字符列。 *C-#* (M-x org-table-rotate-recalc-marks) ，例如下面的表格:

     |   | Student | Prob 1 | Prob 2 | Prob 3 | Total | Note |
     |---+---------+--------+--------+--------+-------+------|
     | ! |         |     P1 |     P2 |     P3 |   Tot |      |
     | # | Maximum |     10 |     15 |     25 |    50 | 10.0 |
     | ^ |         |     m1 |     m2 |     m3 |    mt |      |
     |---+---------+--------+--------+--------+-------+------|
     | # | Peter   |     10 |      8 |     23 |    41 |  8.2 |
     | # | Sam     |      2 |      4 |      3 |     9 |  1.8 |
     |---+---------+--------+--------+--------+-------+------|
     |   | Average |        |        |        |  25.0 |      |
     | ^ |         |        |        |        |    at |      |
     | $ | max=50  |        |        |        |       |      |
     |---+---------+--------+--------+--------+-------+------|
     #+TBLFM: $6=vsum($P1..$P3)::$7=10*$Tot/$max;%.1f::$at=vmean(@-II..@-I);%.1f

     注意，使用 =C-u C-c *= 重新计算表格时，它只会对那些行标记为 '#' 或 '*' 的行，并且单元有一条赋值给它的公式。列公式并不会应用到那些第一个单元是空的行。那些标记字符的含义如下：
     
     '!' ： 在这一行的单元，表示定义这些列的名字，因此，你可以通过 *$Tot* 来代替 *$6* 引用列。
     
     '^' ： 为上面的行定义单元的名字。通过这样定义，任何表格的公式可以使用 *$m1* 来引用值 *10* ，你也可以赋一条公式给一个命名的单元，例如：*$name=....*
     
     '_' ： 类似'^'，不过是为下面的行定义单元的名字。

     '$' ： 这一行的单元，可以为公式定义参数。上面的例子中，在一个 '$' 行包含了一个 *max=50* 的单元，因此，在表格公式中，可以通过 *$max* 来引用这个 *50* 的值。

     '#' ： 这一行的单元可以为自动计算（TAB, RET 或者 S-TAB） 或全局重新计算时进行计算的。取消标记的话，则不会进行计算。

     '*' ： 这一行将在进行全局重新计算(C-u C-c *)时进行计算，但不会为自动计算时进行计算。

     ''  ： 排除计算的行
     
     '/' ： 这种一般用在那些包含 '<N>' 的行或列组中。



****  ASCII 的 plots
      当光标在某一列时，输入 *C-c " a* 或者 *M-x orgtbl-ascii-plot RET* 将会产生一个新的包含 ASCII 码的条形列。 例如：

     | Sede      | Max cites |              |
     |-----------+-----------+--------------|
     | Chile     |    257.72 | WWWWWWWWWWWW |
     | Leeds     |    165.77 | WWWWWWWh     |
     | Sao Paolo |     71.00 | WWW;         |
     | Stockholm |    134.19 | WWWWWW:      |
     | Morelia   |    257.56 | WWWWWWWWWWWW |
     | Ro        |      0.00 |              |
     #+TBLFM: $3='(orgtbl-ascii-draw $2 0.0 257.72 12)

     公式为 *(orgtbl-ascii-draw COLUMN MIN MAX WIDTH)*


